package lesson_55.homeTask.controller;

public class Main {
    public static void main(String[] args) {
//        HashMap<Bar,Integer> barStringHashMap = new HashMap<>();
//        barStringHashMap.put(new Bar<>("Biererei Bar & Vintage Cellar","Horstweg 7, 14059 Berlin",4.4);
//        barStringHashMap.put(new Bar<>("Monkey Bar","Budapester Str. 40, 10787 Berlin"),4.2);
//        barStringHashMap.put(new Bar<>("Gecco Bar Berlin","Rankestraße 3, 10789 Berlin"),4.0);
//        barStringHashMap.put(new Bar<>("Bar Zentral","Lotte-Lenya-Bogen 551, 10623 Berlin"),4.6);
//        barStringHashMap.put(new Bar<>("Heine Bar","Putlitzstraße 19, 10551 Berlin"),4.7);
//        barStringHashMap.put(new Bar<>("Heine Bar","Putlitzstraße 19, 10551 Berlin"),4.7);
//        System.out.println(barStringHashMap.size());
    }
}


//          Задание 2 (Потворение интерфесов, классов, дженериоков, HashMap)
//        Релиз 1
//        Создайте абстрактный класс напиток. Создайте три производных класса: кофе, чай, кола.
//        Создайте интерфейс Natural.
//        Пусть только кофе, чай имплементируют этот интерфейс.
//        Создайте обобщенный класс Bar с полями title, adress, и обобщенным(дженерик) полем drinks.
//        Сделайте ограничения для поля дринкс, оно должно быть ограничено классом Drink и интерфейсом Natural.
//        Релиз 2
//        Создайте HashMap, где бар - это ключ, а значение - это рейтинг.
//        Добавьте в HashMap пары бар-рейтинг, убедитесь, что пары с дублирующимися ключами не добавляются.
//        Если будут добавляться, подумайте, о чем вы могли забыть…
//        Релиз 3
//        Создайте дополнительные поля и методы для интерфесов и классов на ваше усмотрение.
//

